#include <stdio.h>

int main()
{
    int a[3][4] = {1, 2, 3, 4, 5, 6, 7, 8, 9, 1, 2, 3};
    printf("%d , %d\n", a, *a);                           // 0行起始地址  0行0列元素地址
    printf("%d , %d\n", a[0], *(a + 0));                  // 0行0列元素地址
    printf("%d , %d\n", &a[0], &a[0][0]);                 // 0行起始地址 0行0列元素地址
    printf("%d , %d\n", a[1], a + 1);                     // 1行0列起始地址 第1行起始地址
    printf("%d , %d\n", &a[1][0], *(a + 1) + 0);          // 1行0列元素地址
    printf("%d , %d\n", a[2], *(a + 2));                  // 第2行起始地址
    printf("%d , %d\n", &a[2], a + 2);                    // 2行起始地址
    printf("%d , %d\n", a[1][0], *(*(a + 1) + 0));        // 1行0列元素的值
    printf("%-3d , %3d\n", *(a[2] + 1), *(*(a + 2) + 0)); // 2行1列元素的值 2行0列元素的值
    return 0;
}